"""
Есть 2 сортированных последовательности целых чисел.
Хотим напечатать те элементы из первой последовательности, которых нет во второй последовательности.

[2,2,3,5,101],[100,101,102] -> [2,2,3,5]
[100, 101, 102], [2 ,2, 3, 5, 101] -> 100 102
[1,1,1,2],[1,1,1,3] -> 2
[1,1,1,1,1,2,2,3], [1,1,1,1,2,2,2,2,4,6,7] -> 3

[1,1,1], [1]
"""


def diff(arr_1: list[int], arr_2: list[int]) -> list[int]:
    result = []
    p1 = 0
    p2 = 0
    while p1 < len(arr_1) and p2 < len(arr_2):
        if arr_1[p1] < arr_2[p2]:
            result.append(arr_1[p1])
            p1 += 1
        elif arr_1[p1] == arr_2[p2]:
            p1 += 1
        else:
            p2 += 1
    while p1 < len(arr_1):
        result.append(arr_1[p1])
        p1 += 1
    return result


assert diff([2, 2, 3, 5, 101], [100, 101, 102]) == [2, 2, 3, 5]
assert diff([100, 101, 102], [2, 2, 3, 5, 101]) == [100, 102]
assert diff([1, 1, 1, 1, 1, 2, 2, 3], [1, 1, 1, 1, 2, 2, 2, 2, 4, 6, 7]) == [3]
